mesh_study_re20/cylinder_fine/system/functions/outMassFlow
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

outMassFlow
{
    type            surfaceRegion;
    libs            (fieldFunctionObjects);

    writeControl    timeStep;
    writeInterval    1;

    // Dump to file
    log             yes;
    writeFields     false;

    // Sampled patches
    regionType      patch;
    name            out;

    // Operation type
    operation       sum;

    // Field to apply to
    fields
    (
        phi
    );
}


// ************************************************************************* //
