mesh_study_re20/cylinder_fine/system/functions/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

vorticity
{
    type        vorticity;
    libs        (fieldFunctionObjects);

    writeControl    writeTime;
}

// ************************************************************************* //

